rovCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          2640;
        startFace       1163774;
    }
    outlet
    {
        type            patch;
        nFaces          2640;
        startFace       1166414;
    }
    sideXMin
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          3456;
        startFace       1169054;
    }
    sideXMax
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          3456;
        startFace       1172510;
    }
    sideYMin
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          3960;
        startFace       1175966;
    }
    sideYMax
    {
        type            symmetry;
        inGroups        List<word> 1(symmetry);
        nFaces          3960;
        startFace       1179926;
    }
    BROV2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40501;
        startFace       1183886;
    }
)

// ************************************************************************* //
